{"pageProps":{"post":{"title":"LlamaRPG Introduction","date":"2023-02-09T05:35:07.322Z","slug":"intro","author":{"name":"MrLlama","picture":"/assets/blog/authors/mrllama.png"},"content":"<h1>LlamaRPG - Farm to Fable</h1>\n<p>===========================</p>\n<p>I’m sure I’m not the only one who has vivid memories of waking up as a teenager and wanting to do little else but stay in my room and continue my quests. Sadly (and thankfully!) school would often get in my way. Games can be a refuge like that for a lot of people.</p>\n<p>I remember very few quests, but it's not really about remembering them all, right? It's about the way you feel when you're playing a game that speaks to you.</p>\n<p>LlamaRPG - Farm to Fable aims to create that. A game that's memorable.</p>\n<p>A game you'll spend hours with and a game that will stick with you as you continue your IRL journeys.</p>\n<p>We feel that too many of the games made today are centered around a fast dopamine rush that makes you come back for more. We also feel that that's the wrong formula.</p>\n<p>If you come back and keep playing, we want it to be because the game is good, has a great story, and manages to break through to you in a surprising way. Not because it's been engineered to have you spend as much time and money as possible, only to benefit its creators.</p>\n<h2>That's what you can expect from LlamaRPG from a psychological standpoint. But what about a technical one?</h2>\n<hr>\n<p>Here we have our very own Mr. Llama to share some insight into what you can expect. From game style, art, and mechanics, to the story that everyone in our team has fallen in love with.</p>\n<p><strong>Take it away, Alex!</strong></p>\n<p>*LlamaRPG will be a <strong>single-player</strong> campaign with <strong>multiplayer</strong> support for <strong>Trading</strong> and <strong>PvP</strong>. In the future, raiding with other players is planned.</p>\n<p>A JRPG that combines the best parts of your favorite old-school RPGs mixed together into its own unique style.</p>\n<p>LlamaRPG looks to really focus on interesting itemization being a key component of the game. This includes the types of affix rolls, the power gained from items, trading, and other small details.</p>\n<p>Additionally, the game looks to bring a hands-on crafting system focused on utilizing influence to sway the odds of great rolls in your favor.</p>\n<p>This game is focused on the journey of a llama through the world so it will include plenty of fun and silly quests, chats, and overall ideas. One moment you may be fighting off a giant Yeti and the next you might be helping a kitten find its lost mitten. That's how I'd describe it in a nutshell.*</p>\n<h2>Graphics</h2>\n<hr>\n<p><em>From a graphical standpoint, the game is aiming to be a 2D 16-bit style view similar to that of older games. The artwork will be a little bit nicer though and have a bit more detail and shading than the games of that time.</em></p>\n<h2>Combat</h2>\n<hr>\n<p>*The game is turn-based, and combat is another big focus, using a 3-action turn that is a bit more skillful than your basic rock-paper-scissors.</p>\n<p>Players will be able to use 2 of any Action and 1 Spell Action each turn, allowing for combos and plenty of mind games.</p>\n<p>Additionally, players will have an active loadout of 8 weapons and shields, allowing them to constantly switch their style of attack or defense to counter their opponent better.*</p>\n<h2>Pay to Win &#x26; LlamaRPG</h2>\n<hr>\n<p>*This game will not be pay-to-win or resemble anything like games seen in the modern world in that regard.</p>\n<p>There will not be a monthly LlamaPass trying to make you feel left out, there won't be pop-ups trying to sell you things, and there won't be cosmetics that can only be obtained through purchase.</p>\n<p>If you purchase this game, you will get everything you need to fully experience it, without any later hidden fees.*</p>\n<h2>Release Date &#x26; Schedule</h2>\n<hr>\n<p>*LlamaRPG will be released on Steam initially, though it will aim to release on phones and consoles in the future. Again, it will not be utilizing the monetization tactics seen on a large number of phone games but instead will simply be the same game on another system. As a turn-based RPG, LlamaRPG will play quite well on any device.</p>\n<p>There is currently no planned release date, but a lot of backend work has been completed, and the Alpha will hopefully be available sometime in 2023 for initial testing purposes.*</p>\n<h2>The Story</h2>\n<hr>\n<p>You've just been introduced to LlamaRPG - Farm to Fable in every aspect save for a crucial one. The story. On that note, let's take a glimpse into what your quest will be and what strange pastures it will guide you through.</p>\n<p>You awake to the sound of crying llamas, and as you gather information from the town folk, you find out that all of the Baby Llamas in the village have gone missing.</p>\n<p>As you make your way through the village and gain more information, you soon decide to buy a weapon and venture into a new, unknown, and possibly unforgiving world to discover what has become of the baby llamas.</p>\n<p>You take it upon yourself to restore peace, even though you've never ventured outside the comfort of the world you know. After all, can you stay home and feel safe if something is amiss?</p>\n<p>This strange and long journey will take you through several different zones. It will bring you together with unlikely companions, make you question everything you know, and most certainly change you forever.</p>\n<p>No matter. If that's the price you have to pay for the benefit of llamakind, you'll gladly do it, right?</p>\n<h2>What's Next?</h2>\n<hr>\n<p>For us? Work, work, and even more work. Everyone involved in the LlamaRPG Project has and will continue to put long hours into what is starting to take the shape of a beautiful game.</p>\n<p>What's next for you, a longtime Llama Enthusiast? Updates. More and more updates that will bring you closer than ever to LlamaRPG, the way it works, and the team creating it all!</p>\n<p>-Sawyer T.C.</p>\n","ogImage":{"url":"/assets/blog/welcome/welcomecover.jpg"},"coverImage":"/assets/blog/welcome/welcomecover.jpg"}},"__N_SSG":true}